Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་། ནང་ཡོངས་སུ་དང་སྟེ་སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས། རྟོག་པ་མེད་པ་དཔྱོད་པ་མེད་པ་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should the monk Kāśyapa wish to be free of initial consideration and subsequent analysis, inwardly serene, with single-pointed focus, and thereby abide in the perfected state of the second concentration, which is without initial consideration and subsequent analysis, and imbued with the joy and pleasure born of meditative stabilization ,

source: དགེ་སློང་འོད་སྲུང་ཡང་གནས་དེས། ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: the monk Kāśyapa too could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་ང་ནི་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་། དྲན་པ་དང་ཤེས་བཞིན་ཅན་བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ། འཕགས་པ་རྣམས་ཀྱིས་དྲན་པ་དང་ལྡན་པ། བདེ་བ་ལ་གནས་པ། བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་དགའ་བ་མེད་པ་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་
en: “Monks, should I wish to be free from attachment to joy, and thereby settle in impartiality, with mindfulness, introspection, and physical pleasure, and become, as the noble ones say, ‘impartial, mindful, and at ease,’ to abide in the perfected state of the third concentration devoid of joy,

source: ང་ནི་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ། འཕགས་པ་རྣམས་ཀྱིས་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ། དགའ་བ་མེད་པ། བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེགནས་པར་འདོད་ན་ཡང་
en: “Monks, should the monk Kāśyapa wish to be free from attachment to joy, and thereby settle in impartiality, with mindfulness, introspection, and physical pleasure, and become, as the noble ones say, ‘impartial, mindful, and at ease,’ to abide in the perfected state of the third concentration devoid of joy,

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ། བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེགནས་པར་འདོད་ན་ཡང་
en: “Monks, should I wish to relinquish pleasure and, having already given up pain, and with happiness and unhappiness also already gone, abide in the perfected state of the fourth concentration, with neither pleasure nor pain, and with pure impartiality and mindfulness,

source: ང་ནི་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ། གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ་བདེ་བ་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་། ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ། བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should the monk Kāśyapa wish to relinquish pleasure and, having already given up pain, and with happiness and unhappiness also already gone, abide in the perfected state of the fourth concentration, with neither pleasure nor pain, and with pure impartiality and mindfulness,

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ་འགྲན་ཟླ་མེད་པ་གནོད་པ་མེད་པ་ཡངས་པ་རྒྱ་ཆེན་པོར་གྱུར་པ་གཉིས་སུ་མེད་པ་ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་ཕྱོགས་གཅིག་ཏུ་མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དང་དེ་བཞིན་དུ་གཉིས་པ་དང་དེ་བཞིན་དུ་གསུམ་པ་དང་དེ་བཞིན་དུ་བཞི་པ་དང་བླ་དང་འོག་དང་ཐད་ཀར་རྣམ་པ་ཐམས་ཅད་དུ་འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ་འགྲན་ཟླ་མེད་པ་གནོད་པ་མེད་པ་ཡངས་པ་རྒྱ་ཆེན་པོར་གྱུར་པ་གཉིས་སུ་མེད་པ་ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་ཕྱོགས་གཅིག་ཏུ་མོས་ཏེཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should I wish to abide with a loving mind, which is free of hostility, enmity, and ill will, and which is lofty, expansive, nonjudgmental, immeasurable, and well developed, focused on one cardinal direction, pervading it to its very end, and then extend this loving mind, which is free of hostility, enmity, and ill will, and which is lofty, expansive, nonjudgmental, immeasurable, and well developed, to pervade to their very end the second cardinal direction, the third, the fourth, above, below, and straight ahead, encompassing the worlds in their entirety, monks,

source: དགེ་སློང་དག་ང་ནི་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ། བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ་འགྲན་ཟླ་མེད་པ་གནོད་པ་མེད་པ་ཡངས་པ་རྒྱ་ཆེན་པོར་གྱུར་པ་གཉིས་སུ་མེད་པ་ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་ཕྱོགས་གཅིག་ཏུ་མོས་ཏེ། ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་ གནས་པར་འདོད་ན་ཡང་
en: “Monks, should the monk Kāśyapa wish to abide with a loving mind, which is free of hostility, enmity, and ill will, and which is lofty, expansive, nonjudgmental, immeasurable, and well developed, focused on one cardinal direction, pervading it to its very end, and then extend this loving mind, which is free of hostility, enmity, and ill will, and which is lofty, expansive, nonjudgmental, immeasurable, and well developed, to pervade to their very end the second cardinal direction, the third, the fourth, above, below, and straight ahead, encompassing the worlds in their entirety,

source: དགེ་སློང་འོད་སྲུང་ཡང་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ། གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: the monk Kāśyapa too could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དེ་བཞིན་དུ་སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཀྱང་དེ་དང་འདྲ་བར་རྒྱས་པར་བརྗོད་པར་བྱའོ། །
en: “The mind suffused with compassion, joy, and equanimity can be elaborated in kind.

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་
en: “Monks, should I wish to abide in the perfected state of the sphere of boundless space, in which I have transcended the perceptions of form in all respects, such that my perception of physical barriers has vanished, and, no longer bringing to mind the perceptions of diversity, I recognize this to be the sphere of boundless space,

source: ཡང་། ང་ནི་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ཡང་དག་པར་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ། གནས་པར་འདོད་ན་
en: “Monks, should the monk Kāśyapa wish to abide in the perfected state of the sphere of boundless space, in which he has transcended the perceptions of form in all respects, such that his perception of material barriers has vanished, and, no longer bringing to mind the perceptions of diversity, he recognizes this to be the sphere of boundless space,

source: ཡང་དགེ་སློང་འོད་སྲུང་ཡང་གནས་དེས་ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: the monk Kāśyapa too could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should I wish to abide in the perfected state of the sphere of boundless consciousness, in which I have transcended the sphere of boundless space and recognize this to be the sphere of boundless consciousness,

source: ང་ནི་གནས་དེས་ཉིན་གཅིག་གམ། མཚན་གཅིག་གམ། ཉིན་ཞག་གཅིག་གམ། གཉིས་སམ། གསུམ་འམ། ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should the monk Kāśyapa wish to abide in the perfected state of the sphere of boundless consciousness, in which he has transcended the sphere of boundless space in all respect and recognizes this to be the sphere of boundless consciousness,

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should I wish to abide in the perfected state of the sphere of nothing whatsoever, in which I have transcended the sphere of boundless consciousness in all respects and recognize this to be nothing whatsoever,

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་དུ། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should the monk Kāśyapa wish to abide in the perfected state of the sphere of nothing whatsoever, in which he has transcended the sphere of boundless consciousness in all respects and recognizes this to be nothing whatsoever,

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ། གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should I wish to abide in the perfected state of the sphere of neither perception nor non-perception, in which I have transcended the sphere of nothing whatsoever in all respects,

source: ང་ནི་གནས་དེས། ཉིན་གཅིག་གམ་མཚན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: I could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ། རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པར་འདོད་ན་ཡང་།
en: “Monks, should the monk Kāśyapa wish to abide in the perfected state of the sphere of neither perception nor non-perception, in which he has transcended the sphere of nothing whatsoever in all respects,

source: དགེ་སློང་འོད་སྲུང་ཡང་གནས་དེས་ཉིན་གཅིག་གམ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་ཉིན་ཞག་བདུན་གྱི་བར་དུ་ཡང་གནས་སོ། །
en: the monk Kāśyapa too could remain in that state for a day, or a night, or a day and night, or even two, three, or seven such days.

source: དགེ་སློང་དག་ང་ནི་གལ་ཏེ་རྫུ་འཕྲུལ་གྱི་ཡུལ་རྣམ་པ་དུ་མ་མྱོང་བར་བྱེད་འདོད་ན་ཡང་།
en: “Monks, when I wish to do so, I can employ a vast array of miracles.

source: ང་ནི་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར་བ་དང་། མང་པོར་གྱུར་ནས་གཅིག་ཏུ་འགྱུར་བ་དང་སྣང་བར་གྱུར་ཅིང་མི་སྣང་བར་ཡང་འགྱུར་བའི་ཡེ་ཤེས་མཐོང་བ་མྱོང་བར་བྱེད་དོ། །
en: With clear understanding and knowledge of how to materialize and dematerialize I become one and then become many, and having become many, I then become one.

source: རྩིག་པ་ལ་ཡང་ཐད་ཀར་འགྲོའོ། །
en: I pass directly through walls.

source: ར་བ་ལ་ཡང་ཐད་ཀར་འགྲོའོ། །
en: I pass directly through enclosed spaces.

source: རི་ལ་ཡང་མི་ཐོགས་པར་ལུས་ཀྱིས་འགྲོ་སྟེ། དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བ་བཞིན་ནོ། །
en: Bodily I pass directly through mountains, unobstructed, just as if they were empty space.

source: ས་ལ་ཡང་སྟེང་དུ་འབྱུང་བ་དང་བྱིའུ་ཟུལ་བྱེད་དེ་དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ། །
en: I dive into the earth like a seagull into water.

source: ཆུ་ལ་ཡང་མི་ནུབ་པར་འགྲོ་སྟེ་དཔེར་ན་ས་ཆེན་པོ་ལ་བྱ་བ་བཞིན་ནོ། །
en: I walk on water without sinking into it, just as if it were the surface of the earth.

source: ནམ་མཁའ་ལ་ཡང་སྐྱིལ་མོ་ཀྲུང་འཆའ་བར་བྱེད་དེ་དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ། །
en: I sit cross-legged in the sky like a bird.

source: ཟླ་བ་དང་ཉི་མ་འདི་གཉིས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ་འདི་ལྟར་མཐུ་ཆེ་བ་འདི་ལྟར་གཟི་བརྗིད་ཆེ་བ་ལ་ཡང་ལག་པས་འཛིན་ཅིང་ཀུན་དུ་ཉུག་པར་བྱེད་དོ། །
en: I hold and caress radiant beams like those of the sun and moon, those in miraculous displays, and those of feats of magic.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ཡང་ལུས་ཀྱིས་དབང་སྒྱུར་རོ། །
en: I can physically control the worlds all the way up to Brahmāloka.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་ཡང་གལ་ཏེ་རྫུ་འཕྲུལ་གྱི་ཡུལ་རྣམ་པ་དུ་མ་མྱོང་བར་བྱེད་འདོད་ན་ཡང་།
en: “Monks, when the monk Kāśyapa wishes to do so, he too can employ a vast array of miracles.

source: དགེ་སློང་འོད་སྲུང་ཡང་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར་བ་དང་། མང་པོར་གྱུར་ནས་གཅིག་ཏུ་འགྱུར་བ་དང་། སྣང་བར་གྱུར་ཅིང་མི་སྣང་བར་འགྱུར་བའི་ཡེ་ཤེས་མཐོང་བ་མྱོང་བར་བྱེད་དོ། །
en: With clear understanding and knowledge of how to materialize and dematerialize the monk Kāśyapa likewise becomes one and then becomes many, and having become many, he then becomes one.

source: རི་ལ་ཡང་མི་ཐོགས་པར་ལུས་ཀྱིས་འགྲོ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བ་བཞིན་ནོ། །
en: Bodily he passes directly through mountains, unobstructed, just as if they were empty space.

source: ས་ལ་ཡང་སྟེང་དུ་འབྱུང་བ་དང་བྱིའུ་ཟུལ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ། །
en: He dives into the earth like a seagull into water.

source: ནམ་མཁའ་ལ་ཡང་སྐྱིལ་མོ་ཀྲུང་འཆའ་བར་བྱེད་དེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ། །
en: He sits cross-legged in the sky like a bird.

source: ཟླ་བ་དང་ཉི་མ་འདི་གཉིས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ། འདི་ལྟར་མཐུ་ཆེ་བ་འདི་ལྟར་གཟི་བརྗིད་ཆེ་བ་ལ་ཡང་ལག་པས་འཛིན་ཅིང་ཀུན་ཏུ་ཉུག་པར་བྱེད་དོ། །
en: He holds and caresses radiant beams like those of the sun and moon, those in miraculous displays, and those of feats of magic.

source: དགེ་སློང་དག་ངས་ནི་ལྷའི་སྙན་རྣམ་པར་དག་པ། མི་ལས་འདས་པས་མི་དང་མི་མ་ཡིན་པ་གཉི་གའི་སྒྲ་ཡང་རིང་བ་གང་ཡིན་པ་དང་ཉེ་བ་གང་ཡིན་པ་ཡང་ཐོས་སོ། །
en: “Monks, with perfectly clear divine hearing, beyond that of normal humans, I hear the sounds of both humans and nonhumans, be they near or far.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་གིས་ཀྱང་ལྷའི་སྙན་རྣམ་པར་དག་པ། མི་ལས་འདས་པས་མི་དང་མི་མ་ཡིན་པ་གཉི་གའི་སྒྲ་ཡང་རིང་བ་གང་ཡིན་པ་དང་ཉེ་བ་གང་ཡིན་པ་ཡང་ཐོས་སོ། །
en: “Monks, with perfectly clear divine hearing, beyond that of normal humans, the monk Kāśyapa too hears the sounds of both humans and nonhumans, be they near or far.

source: དགེ་སློང་དག་ངས་ནི། སེམས་ཅན་ཕ་རོལ་རྣམས་དང་གང་ཟག་ཕ་རོལ་རྣམས་ཀྱི་རྟོག་པ་དང་དཔྱོད་པའི་སེམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཀྱིས་ཤེས་སོ། །
en: “Monks, I know the minds of other beings and other persons, with their initial consideration and subsequent analysis, exactly as they are.

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་དང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Lustful minds and minds free of lust I know in full, exactly as they are.

source: ཞེ་སྡང་དང་བཅས་པའི་སེམས་དང་ཞེ་སྡང་དང་བྲལ་བའི་སེམས་དང་།
en: Hateful minds and minds free of hatred;

source: གཏི་མུག་དང་བཅས་པའི་སེམས་དང་། གཏི་མུག་དང་བྲལ་བའི་སེམས་དང་།
en: ignorant minds and minds free of ignorance;

source: བསྡུས་པ་དང་། འཕྲོས་པ་དང་། ཞུམ་པ་དང་། བསྡམས་པ་དང་། རྒོད་པ་དང་། རྒོད་པ་མ་ཡིན་པ་དང་། ཆེན་པོར་གྱུར་པ་དང་། རྣམ་པར་ཞི་བ་དང་། རྣམ་པར་མ་ཞི་བ་དང་། མཉམ་པར་བཞག་པ་དང་། མཉམ་པར་མ་གཞག་པ་དང་། བསྒོམས་པ་དང་། མ་བསྒོམས་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་མ་གྲོལ་བའི་སེམས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: minds closed or radiant, dull or disciplined, wild or tame, lofty, tranquil, or turbulent, resting in equanimity or not resting so, cultivated or uncultivated; and those liberated, those not,

source: ཤིན་ཏུ་རྣམ་པར་གྲོལ་བའི་སེམས་ལ་ཡང་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བའི་སེམས་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: those completely and utterly liberated, and those not—all these I know in full, exactly as they are.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་གིས་ཀྱང་སེམས་ཅན་ཕ་རོལ་རྣམས་དང་། གང་ཟག་ཕ་རོལ་རྣམས་ཀྱི་རྟོག་པ་དང་དཔྱོད་པའི་སེམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཀྱིས་ཤེས་སོ། །
en: “Monks, the monk Kāśyapa also knows exactly the minds of other beings and other persons, with their initial consideration and subsequent analysis exactly as they are.

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Lustful minds and minds free of lust he knows in full, exactly as they are.

source: ཞེ་སྡང་དང་བཅས་པའི་སེམས་དང་། ཞེ་སྡང་དང་བྲལ་བའི་སེམས་དང་།
en: Hateful minds and minds free of hatred;

source: བསྡུས་པ་དང་། འཕྲོས་པ་དང་། ཞུམ་པ་དང་། བསྡམས་པ་དང་། རྒོད་པ་དང་། རྒོད་པ་མ་ཡིན་པ་དང་། ཆེན་པོར་གྱུར་པ་དང་། རྣམ་པར་ཞི་བ་དང་། རྣམ་པར་མ་ཞི་བ་དང་། མཉམ་པར་གཞག་པ་དང་། མཉམ་པར་མ་གཞག་པ་དང་། བསྒོམས་པ་དང་། མ་བསྒོམས་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་མ་གྲོལ་བའི་སེམས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: minds closed or radiant, dull or disciplined, wild or tame, lofty, tranquil, or turbulent, resting in equanimity or not resting so, cultivated or uncultivated; and those completely liberated, those not,

source: དགེ་སློང་དག་ངས་ནི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ།
en: “Monks, I can recall many of my previous lives.

source: འདི་ལྟ་སྟེ་སྐྱེ་བ་གཅིག་དང་། གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། དྲུག་དང་། བདུན་དང་། བརྒྱད་དང་། དགུ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། སྐྱེ་བ་བརྒྱ་དང་། སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་འབུམ་དང་། སྐྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་འབུམ་ཕྲག་དུ་མ་དང་། འཇིག་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པའི་བསྐལ་པ་དུ་མ་དང་། འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་།
en: I remember one life, or two, or three—four, five, six, seven, eight, nine, ten, twenty, thirty, forty, or fifty—or a hundred lives, a thousand lives, a hundred thousand lives, hundreds upon hundreds of thousands of lives, hundreds upon hundreds of millions of lives, an eon of dissolution, an eon of the formation of the universe, an eon of dissolution and formation , many eons of dissolution, many eons of formation , or many eons of dissolution and formation.

source: སེམས་ཅན་དེ་དག་ནི་མིང་འདི་ཞེས་བྱ་བར་གྱུར། ག་གེ་མོ་ཞིག་ན་བདག་མིང་འདི་ཞེས་བྱ་བར་གྱུར། རིགས་ནི་འདི་ཞེས་བྱ་རུས་ནི་འདི་ཞེས་བྱ།
en: “I can remember my identity as all those beings: that I was born in such-and-such a place into this family and that clan,

source: ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ།
en: what kinds of food I ate,

source: བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་།
en: the happiness and suffering I experienced during my life,

source: ཡུན་ནི་འདི་སྲིད་ཅིག་གནས་གནས།
en: how long I was in each state of rebirth,

source: ཚེ་ནི་འདི་ལྟར་རིང་། ཚེ་ནི་འདི་ཙམ་ཞིག་ཐུབ།
en: the potential duration of each life, how long each life in fact lasted, that

source: ང་དེ་ནས་ཤི་འཕོས་ནས་ག་གེ་མོ་ཞིག་ཏུ་སྐྱེས།
en: after I died I transmigrated and took rebirth in such-and-such a place,

source: ག་གེ་མོ་ཞིག་ནས་ཡང་ཤི་འཕོས་ནས་ཡང་འདི་ལྟ་བུ་ཞིག་ཏུ་སྐྱེས་སོ་སྙམ་དུ་རྣམ་པ་དང་བཅས་པ་དང་། ཡུལ་ཕྱོགས་དང་བཅས་པ་དང་། གཏན་ཚིགས་དང་བཅས་པར་རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ། །
en: and that when I died from there and transmigrated, what type of rebirth I took. I can recall the many aspects of my previous states, including each aspect, their locations, and the reasons behind them.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་གིས་ཀྱང་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ་འདི་ལྟ་སྟེ།
en: “Monks, the monk Kāśyapa can also recall many of his previous lives.

source: སྐྱེ་བ་གཅིག་དང་། གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། དྲུག་དང་། བདུན་དང་། བརྒྱད་དང་། དགུ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། སྐྱེ་བ་བརྒྱ་དང་། སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་འབུམ་དང་། སྐྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་འབུམ་ཕྲག་དུ་མ་དང་། འཇིག་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པའི་བསྐལ་པ་དུ་མ་དང་། འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་།
en: He remembers one life, or two, or three—four, five, six, seven, eight, nine, ten, twenty, thirty, forty, or fifty—or a hundred lives, a thousand lives, a hundred thousand lives, hundreds upon hundreds of thousands of lives, hundreds upon hundreds of millions of lives, an eon of dissolution, an eon of the formation of the universe, an eon of dissolution and formation , many eons of dissolution, many eons of formation , or many eons of dissolution and formation.

source: སེམས་ཅན་དེ་དག་ནི་མིང་འདི་ཞེས་བྱ་བར་གྱུར། ག་གེ་མོ་ཞིག་ན་བདག་མིང་འདི་ཞེས་བྱ་བར་གྱུར། རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ།
en: “He can remember his identity as all those beings: that he was born in such-and-such a place into this family and that clan,

source: ང་དེ་ནས་ཤི་འཕོས་ནས་ག་གེ་མོ་ཞིག་ཏུ་སྐྱེས་ག་གེ་མོ་ཞིག་ནས་ཤི་འཕོས་ནས་ཡང་འདི་ལྟ་བུ་ཞིག་ཏུ་སྐྱེས་སོ་
en: that after he died he transmigrated and took rebirth in such-and-such a place, and that when he died from there and transmigrated, what type of rebirth he took.

source: སྙམ་དུ་རྣམ་པ་དང་བཅས་པ་དང་། ཡུལ་ཕྱོགས་དང་བཅས་པ་དང་། གཏན་ཚིགས་དང་བཅས་པར་རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ། །
en: He can recall the many aspects of his previous states, including each aspect, their locations, and the reasons behind them.

source: དགེ་སློང་དག་ངས་ནི་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། སེམས་ཅན་རྣམས་འཆི་འཕོ་ཞིང་འདུག་པ་དང་། སྐྱེ་ཞིང་འདུག་པ་དང་། ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་དང་། བཟང་པོ་དང་ངན་པ་དང་། བདེ་འགྲོར་འགྲོ་བ་དང་། ངན་འགྲོར་འགྲོ་བ་ཡང་རུང་སྟེ
en: “Monks, with perfectly clear divine vision, beyond that of normal humans, I see how beings continue to die, transmigrate, and take birth; whether they will be of good appearance, bad appearance, or good and bad appearance; and if they will take happy births or fall to lower realms.

source: སེམས་ཅན་རྣམས་ལས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Fully aware of their actions, I am fully aware of their destinations.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ་ཡིན། ལོག་པར་ལྟ་བ་ཡིན་ཏེ། ལོག་པར་ལྟ་བའི་ལས་དང་ཆོས་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེས་ན་ལུས་དང་བྲལ་ཏེ་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: “I see that when they separate from their bodies at death—by cause and condition of adopting the wrong teachings and actions—those who comport themselves wrongly, those who speak wrongly, those who reflect wrongly, those who hurl insults at the noble ones, and those who hold wrong views will fall to lower realms and take rebirth as hell beings.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་ཡིན། འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ་ཡིན། ཡང་དག་པར་ལྟ་བ་ཡིན་ཏེ། ཡང་དག་པར་ལྟ་བའི་ལས་དང་ཆོས་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེས་ལུས་དང་བྲལ་ཏེ། ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་བར་མཐོང་ངོ་། །
en: And I see that when they separate from their bodies at death—by cause and condition of adopting the right teachings and actions—those who comport themselves rightly, those who speak rightly, those who reflect rightly, those who refrain from hurling insults at the noble ones, and those who hold right views will travel to happy migrations and take rebirth among gods in the heavens.

source: དགེ་སློང་དག་དགེ་སློང་འོད་སྲུང་གིས་ཀྱང་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས་སེམས་ཅན་རྣམས་འཆི་འཕོས་ཤིང་འདུག་པ་དང་། སྐྱེ་ཞིང་འདུག་པ་དང་། ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་དང་། བཟང་པོ་དང་ངན་པ་དང་། བདེ་འགྲོར་འགྲོ་བ་དང་། ངན་འགྲོར་འགྲོ་བ་ཡང་རུང་སྟེ
en: “Monks, with perfectly clear divine vision, beyond that of normal humans, the monk Kāśyapa also sees how beings continue to die, transmigrate, and to take birth; whether they will be of good appearance, bad appearance, or good and bad appearance; and if they will take happy births or fall to lower realms.
